app/views/groups/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = ?  [["group_id", 1]]
---
        <td><%= group.moderator_name %></td>
        <td><%group.users.each do |user| %>