app/views/users/index.html.erb

        <td><%= user.phone %></td>
        <td><% user.friends.each do |friend| %>
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 1]]

        <td><%= user.profile.state.capitalize %></td>
        <td><%user.groups.each do |group| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ?  [["user_id", 1]]

            <%end %></td>
        <td><%user.enrollments.each do |enrollment| %>
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = ?  [["user_id", 1]]