app/views/groups_users/index.html.erb

      <tr>
        <td><%= groups_user.group.name.upcase %></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]