app/views/groups_users/show.html.erb

  <strong>Group:</strong>
  <%= @groups_user.group %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]