app/controllers/colleges_controller.rb

  def index
    @colleges = College.all
---
SELECT "colleges".* FROM "colleges"

  def create
    @college = College.new(college_params)

    respond_to do |format|
      if @college.save
---
INSERT INTO "colleges" ("name", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "CSU FULLERTON"], ["website", "www.fullerton.edu"], ["created_at", "2017-03-06 03:48:52.648847"], ["updated_at", "2017-03-06 03:48:52.648847"]]

  def update
    respond_to do |format|
      if @college.update(college_params)
---
UPDATE "colleges" SET "name" = ?, "updated_at" = ? WHERE "colleges"."id" = ?  [["name", "California State University"], ["updated_at", "2017-03-07 16:39:02.645951"], ["id", 1]]

    def set_college
      @college = College.find(params[:id])
---
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = ? LIMIT 1  [["id", 1]]