app/controllers/enrollments_controller.rb

  def index
    @enrollments = Enrollment.all
---
SELECT "enrollments".* FROM "enrollments"

  def create
    @enrollment = Enrollment.new(enrollment_params)

    respond_to do |format|
      if @enrollment.save
---
INSERT INTO "enrollments" ("user_id", "college_id", "degree", "year_of_grad", "gpa", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["college_id", 1], ["degree", "Masters"], ["year_of_grad", 2014], ["gpa", 4.0], ["created_at", "2017-03-06 03:51:01.520977"], ["updated_at", "2017-03-06 03:51:01.520977"]]

  def update
    respond_to do |format|
      if @enrollment.update(enrollment_params)
---
UPDATE "enrollments" SET "college_id" = ?, "updated_at" = ? WHERE "enrollments"."id" = ?  [["college_id", 3], ["updated_at", "2017-03-07 16:21:14.170677"], ["id", 3]]

    def set_enrollment
      @enrollment = Enrollment.find(params[:id])
---
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT 1  [["id", 3]]