app/controllers/friends_controller.rb

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("name", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "friend1"], ["email", "friend1@gmail.com"], ["user_id", 1], ["created_at", "2017-03-05 07:50:35.688206"], ["updated_at", "2017-03-05 07:50:35.688206"]]

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["name", "praveen"], ["updated_at", "2017-03-07 16:37:27.318332"], ["id", 1]]