app/controllers/groups_users_controller.rb

SELECT "groups_users".* FROM "groups_users"
---
  def index
    @groups_users = GroupsUser.all

INSERT INTO "groups_users" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 1], ["user_id", 2], ["created_at", "2017-03-05 09:10:46.034120"], ["updated_at", "2017-03-05 09:10:46.034120"]]
---
  def create
    @groups_user = GroupsUser.new(groups_user_params)

    respond_to do |format|
      if @groups_user.save

UPDATE "groups_users" SET "group_id" = ?, "updated_at" = ? WHERE "groups_users"."id" = ?  [["group_id", 4], ["updated_at", "2017-03-07 15:18:56.942156"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @groups_user.update(groups_user_params)

SELECT  "groups_users".* FROM "groups_users" WHERE "groups_users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_groups_user
      @groups_user = GroupsUser.find(params[:id])