app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "description", "moderator_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dc"], ["description", "no worker to do"], ["moderator_name", "sai"], ["created_at", "2017-03-05 09:09:46.043489"], ["updated_at", "2017-03-05 09:09:46.043489"]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

UPDATE "groups" SET "moderator_name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["moderator_name", "venkat"], ["updated_at", "2017-03-07 15:59:53.290199"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)