app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("picture_path", "state", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)